Repository: renankanu/flutter-portfolio
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Mobile Developer
pt: Desenvolvedor Mobile

source: About
pt: Sobre

source: About Me
pt: Sobre Mim

# aboutMeDescOne
source: Hello, my name is Renan, I'm from Cianorte-PR. I started programming in 2016 as a Native Android developer with Java, in 2018 I started programming Android Native with Kotlin, PHP and worked with some AWS services such as: eC2, RDS, SNS, SES, S3 ... And in the second half of 2019 I started programming in React Native and Flutter at Megaleios and I am so far.
pt: Olá, meu nome é Renan sou de Cianorte-PR. Comecei na programação em 2016 como desenvolvedor Android Nativo com Java, em 2018 comecei a programar Android Nativo com Kotlin, PHP e trabalhei com alguns serviços da AWS como: eC2, RDS, SNS, SES, S3... E no segundo semestre de 2019 comecei a programar em React Native e Flutter na Megaleios e estou até o momento.

# aboutMeDescTwo
source: I like all subjects that involve technology, rugby player, I like electronic games, bodybuilder and English student. Coffee, coffee and coffee â˜•
pt: Gosto de todos os assuntos que envolvem tecnologia, jogador de rugby, gosto de jogos eletrónicos, praticante de musculação e estudante de inglês. Café, café e café ☕

source: Experience
pt: Experiência

# repository
source: Repositories
pt: Repositórios

# favoriteRepo
source: Favorite Repositories
pt: Repositórios Favoritos

# loadingRepo
source: Loading repositories
pt: Carregando repositórios

source: Total commits ->
pt: Total de commits ->

# prevCurrentWork
source: Previous and current work
pt: Trabalho anterior e atual

# actualWorkDate
source: Sept. 2019 - current
pt: Set. de 2019 - atual

# expMegaOne
source: -> Mobile development using React Native and Flutter;
pt: -> Desenvolvimento Mobile utilizando React Native e Flutter;

# expMegaTwo
source: -> Publication of APPs on Android and iOS stores;
pt: -> Publicação dos APP nas lojas Android e iOS;

# expMegaThree
source: -> Refactoring and implementation of new features;
pt: -> Refatoração e implementação de novas features;

# oldWork
source: Jul. 2016 - Sept. 2019
pt: Jul. de 2016 - Set. de 2019

# oldExpOne
source: -> Development of native Android applications (Java and Kotlin);
pt: -> Desenvolvimento de aplicativos para Android nativo (Java e Kotlin);

# oldExpTwo
source: -> Development of applications in PHP using DDD for back-end;
pt: -> Desenvolvimento de aplicações em PHP utilizando DDD para back-end;

# oldExpThree
source: -> Using REST APIs;
pt: -> Usando APIs REST;

# oldExpFour
source: -> Version control with GIT;
pt: -> Controle de versão com GIT;

# oldExpFive
source: -> Knowledge in Docker;
pt: -> Conhecimento em Docker;

# oldExpSix
source: -> Knowledge in AWS (Lambda, SNS, SQS, SES, EC2, RDS, S3);
pt: -> Conhecimento em AWS (Lambda, SNS, SQS, SES, EC2, RDS, S3);

# oldExpSeven
source: -> Linux user (GNU / Linux Ubuntu);
pt: -> Usuário Linux (GNU / Linux Ubuntu);

# copyright
source: Copyright Â©
pt: Copyright ©

# madeFlutter
source: Made with Flutter ðŸ’™
pt: Feito com Flutter 💙

# flutterSkill
source: Design and develop apps, write clean code, integrate with rest API, fix bugs, using modular, bloc and bitrise for CI / CD
pt: Projetar e desenvolver aplicativos, escreva um código limpo, integrar com API Rest, com corrigir bugs, utilizando modular, bloc e bitrise para CI/CD

# rnSkill
source: Design and develop applications with JavaScript / TypeScript, working with Redux, Styled Component, integrating with external services
pt: Projetar e desenvolver aplicativos com JavaScript/TypeScript, trabalhando com Redux, Styled Component, integrar com serviços externos

# jsSkill
source: es6, function declarations and arrow functions, template literals, short terms: &&, ||, ternary operator, array methods: .map (), .filter (), .reduce (), promises + Async / Await syntax, Hooks
pt: es6, declarações de função e arrow functions, template literals, condições curtas: &&, ||, operador ternário, métodos de array: .map (), .filter (), .reduce (), sintaxe promises + Async/Await, Hooks

# tsSkill
source: Data Types, Class and Objects, Access Modifiers, Constructor, Methods, Inheritance, Modules
pt: Tipos de dados, classes e objetos, modificadores de acesso, construtor, métodos, herança, módulos

# phpSkill
source: Ddd with PHP, back end API Rest application, dockerize application, unit testing
pt: Ddd com PHP, aplicação para back end API Rest, dockerize aplicação, teste unitários

# gitSkill
source: Skipping files in Git, reversing repository history, staging, resolving merge, stash unconfirmed changes, logs
pt: Ignorando arquivos no Git, rever a história do repositório, staging, resolver merge, stash mudanças uncommitted, logs

# appleStoreSkill
source: APP configuration for the store, TestFlight and publishing
pt: Configuração do APP para a loja, TestFlight e publicação

# dockerSkill
source: Container management with docker
pt: Administração de containers com docker

# awsSkill
source: Knowledge in some services such as: eC2, SES, SNS, SQS, Route53, Lambda, RDS and S3
pt: Conhecimento em alguns serviços como: eC2, SES, SNS, SQS, Route53, Lambda, RDS e S3
